Repository: 84000/data-translation-memory
Catalog: toh178-v2.tmx
Source language: bo
Languages: en

source: འཇམ་དཔལ་དེ་ལྟ་བས་ན། དགེ་སློང་ཡུལ་འཁོར་གྱི་བསོད་སྙོམས་དོན་ཡོད་པར་ཡོངས་སུ་བཟའ་བར་འདོད་པ་དང་། བདུད་འདུལ་བར་འདོད་པ་དང་། འཁོར་བ་ལས་ཡང་དག་པར་འདའ་བར་འདོད་པ་དང་། མྱ་ངན་ལས་འདས་པ་ཐོབ་པར་འདོད་པ་དང་། སྡུག་བསྔལ་རྣམས་ལས་གྲོལ་བར་འདོད་པས་ཆོས་འདི་དག་ལ་བརྩོན་པར་བྱའོ། །
en: “Therefore, Mañjuśrī, those bhikṣus who seek to partake of the country’s alms in a beneficial way, who seek to subdue Māra, who seek to transcend saṃsāra, who seek to attain nirvāṇa, and who seek to become liberated from suffering should work diligently on these Dharmas.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་པ་ན་ལྷའི་བུ་སུམ་ཁྲི་ཉིས་སྟོང་གིས་ཆོས་མངོན་པར་རྟོགས་པར་གྱུར་ནས་
en: When this Dharma discourse was taught, thirty-two thousand gods realized the Dharma.

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མན་དཱ་ར་བའི་མེ་ཏོག་གིས་གཏོར་ཏེ་
en: They sprinkled mandārava flowers upon the Bhagavān and

source: ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: uttered these words:

source: བཅོམ་ལྡན་འདས་ཆོས་བསྟན་པ་འདི་སུ་དག་གི་རྣ་ལམ་དུ་གྲག་པར་གྱུར་པ་དེ་དག་ནི། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་ལེགས་པར་རབ་ཏུ་བྱུང་བ་ལེགས་པར་འགྱུར་ན།
en: “If those who just happen to hear this Dharma teaching by the Bhagavān will successfully go forth under the Tathāgata’s dispensation and do well,

source: གང་དག་ཐོས་ནས་མོས་པ་དང་། དད་པ་དང་། དེ་བཞིན་ཉིད་དུ་འཛིན་པར་འགྱུར་བ་དག་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ། །
en: what more needs to be said of those who, having listened to it, have confidence and faith in it, and uphold it accordingly?

source: བཅོམ་ལྡན་འདས་ཆོས་བསྟན་པ་འདི་སུ་དག་གི་རྣ་ལམ་དུ་གྲག་པར་གྱུར་པ་དེ་དག་ནི། མངོན་པའི་ང་རྒྱལ་མ་མཆིས་པར་འགྱུར་རོ། །
en: Indeed, those who happen to hear this Dharma teaching by the Bhagavān will not become conceited.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: After the Bhagavān had spoken this teaching,

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: Youthful Mañjuśrī, the great śrāvakas, and the world with its gods, humans, demigods, and gandharvas rejoiced, and

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: they praised what the Bhagavān had said.

source: འཕགས་པ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the Noble Mahāyāna Sūtra, “ The Teaching on the Aids to Enlightenment .”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། ཛྙཱ་ན་སིདྡྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ། སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།
en: This sūtra was translated, edited, and finalized, based on revisions done according to the language reform, by the Indian masters Jinamitra and Jñānasiddhi, and by the chief editor and translator, the venerable Yeshé Dé.
